// defien variable
var x = 10, y = 20;

// condition 1
if (x == y) {
    document.write("x와 y는 같습니다.");
}

// condition 2
if (x < y) {
    document.write("x가 y보다 작습니다.");
}

// 실행될 실행문이 한 줄뿐이라면 중괄호({})를 생략할 수 있음.
if (x > y) 
    document.write("x가 y보다 큽니다.");

//////////////////////////////////////////////////////////////////////////

// defien variable
var x = 10, y = 20;

// condition
if (x == y) {
    document.write("x와 y는 같습니다.");
} else {
    if (x < y)
        document.write("x가 y보다 작습니다.");
    else // 실행될 실행문이 한 줄뿐이라면 중괄호({})를 생략할 수 있음.
        document.write("x가 y보다 큽니다.");
}

//////////////////////////////////////////////////////////////////////////

// defien variable
var x = 10, y = 20;

// condition
if (x == y) {
    document.write("x와 y는 같습니다.");
} else if (x < y) {
    document.write("x가 y보다 작습니다.");
} else { // x > y인 경우
    document.write("x가 y보다 큽니다.");
}

//////////////////////////////////////////////////////////////////////////

var x = 10;

switch (typeof x) {
    case "number":
        document.write("변수 x의 타입은 숫자입니다.");
        break;
    case "string":
        document.write("변수 x의 타입은 문자열입니다.");
        break;
    case "object":
        document.write("변수 x의 타입은 객체입니다.");
        break;
    default:
        document.write("변수 x의 타입을 잘 모르겠네요...");
        break;
}

//////////////////////////////////////////////////////////////////////////

var x = "문자열";

// switch don't have 'break'
switch (typeof x) {
    case "number":
        document.write("변수 x의 타입은 숫자입니다.<br>");
    case "string":
        document.write("변수 x의 타입은 문자열입니다.<br>");
    case "object":
        document.write("변수 x의 타입은 객체입니다.<br>");
    default:
        document.write("변수 x의 타입을 잘 모르겠네요...<br>");
}

//////////////////////////////////////////////////////////////////////////

var day = new Date().getDay(); // 오늘의 요일을 반환함. (일요일: 0 ~ 토요일: 6)

switch (day) {
    case 1: // 월요일인 경우
    case 2: // 화요일인 경우
    case 3: // 수요일인 경우
    case 4: // 목요일인 경우

    default: // 0부터 6까지의 값이 아닌 경우
        document.write("아직도 주말은 멀었네요... 힘내자구요!!");
        break;

    case 5: // 금요일인 경우
        document.write("오늘은 불금이네요!!");
        break;

    case 6: // 토요일인 경우

    case 0: // 일요일인 경우
        document.write("즐거운 주말에도 열심히 공부하는 당신~ 최고에요!!");
        break;

}

//////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////


//////////////////////////////////////////////////////////////////////////